{
  "type": "Feature",
  "stac_version": "1.0.0",
  "id": "sentinel-1-maritime-mesocyclone-dataset",
  "properties": {
    "start_datetime": "2015-09-15T00:00:00Z",
    "end_datetime": "2020-12-28T00:00:00Z",
    "title": "Sentinel-1 maritime mesocyclone dataset",
    "description": "This dataset consists of 2004 geocoded Sentinel-1 image samples, divided into two classes: one class with mesocyclones being present in the images (class \"pos\"), and one class with mesocyclones being absent (class \"neg\").\nThe dataset is divided in training and test set. The training set contains 1,547 images (254 of class \"pos\", 1,293 of class \"neg\"). The test set contains 435 images (64 of class \"pos\", 371 of class \"neg\").\nThe dataset was used for the first time in the paper \"Recognition of polar lows in Sentinel-1 SAR images with deep learning\", where a detailed description of the dataset formation is presented. In the paper, the dataset is used to study the possibility of detecting polar lows in C-band SAR images. Specifically, a deep learning model was trained to classify the labelled images. Evaluated on an independent test set, the model yields an F-1 score of 0.95, indicating that polar lows can be consistently detected from SAR images. Interpretability techniques applied to the deep learning model reveal that atmospheric fronts and cyclonic eyes are key features in the classification. Moreover, experimental results show that the model is accurate even if: (i) such features are significantly cropped due to the limited swath width of the SAR, (ii) the features are partly covered by sea ice and (iii) land is covering significant parts of the images. By evaluating the model performance on multiple input image resolutions (pixel sizes of 500m, 1km and 2km), it is found that higher resolutions yield the best performance. This emphasises the potential of using high-resolution sensors like SAR for detecting polar lows, as compared to conventionally used sensors such as scatterometers.\n",
    "osc:missions": [
      {
        "name": "ASCAT",
        "summary": {
          "years": [
            2007,
            2008,
            2009,
            2010,
            2011,
            2012,
            2013,
            2014,
            2015,
            2016,
            2017,
            2018,
            2019,
            2020
          ],
          "numberOfProducts": 2,
          "numberOfVariables": 2
        }
      },
      "AVHRR"
    ],
    "osc:project": "Polar Low detection from S-1 data",
    "osc:themes": [
      "Atmosphere"
    ],
    "osc:variable": [],
    "osc:status": "ONGOING",
    "osc:region": "Global",
    "osc:type": "Product",
    "datetime": "2022-03-30T00:00:00Z"
  },
  "geometry": {
    "type": "Polygon",
    "bbox": "-180.00, -78.00, 180.00, 83.00",
    "coordinates": [
      [
        [
          "-",
          "1"
        ],
        [
          "8",
          "1"
        ],
        [
          "8",
          "0"
        ],
        [
          "-",
          "0"
        ],
        [
          "-",
          "1"
        ]
      ]
    ]
  },
  "links": [
    {
      "rel": "via"
    },
    {
      "rel": "via",
      "href": "https://dataverse.no/dataset.xhtml?persistentId=doi:10.18710/FV5T9U",
      "title": "Access"
    },
    {
      "rel": "via",
      "href": "https://ieeexplore.ieee.org/document/9878346",
      "title": "Documentation"
    }
  ],
  "assets": {},
  "bbox": "-180.00, -78.00, 180.00, 83.00",
  "stac_extensions": [
    "https://stac-extensions.github.io/osc/v1.0.0/schema.json"
  ]
}